app/views/book/list.html.erb

<ul id = "subjects">
   <% Subject.all.each do |c| %>
---
SELECT "subjects".* FROM "subjects"