app/controllers/book_controller.rb

   	def new
   		@book = Book.new
   		@subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

   	def create
   		@book = Book.new(book_params)
   		if @book.save
---
INSERT INTO "books" ("title", "price", "subject_id", "description", "created_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hcv1"], ["price", 250.0], ["subject_id", 1], ["description", "hcv"], ["created_at", "2018-04-19 12:02:03.837636"]]

   	def edit
   	   @book = Book.find(params[:id])
   	   @subjects = Subject.all
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects"

   	def delete
   	   Book.find(params[:id]).destroy
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

   	def show_subjects
   	   @subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]